# How to create a dataframe

In [2]:
#creating a dataframe using List
import pandas as pd
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
# creating a dataframe using Dictonary 

dictonary={'fruit':['apple','jackfruit','orange'],'count':[10,12,15]}
df=pd.DataFrame(dictonary)
df

       fruit  count
0      apple     10
1  jackfruit     12
2     orange     15

In [8]:
#creating a dataframe using series

series=pd.Series([3,5],index=['a','b'])
df=pd.DataFrame(series)
df

   0
a  3
b  5

In [12]:
#creating a dataframe using numpyarray
import numpy as np
numpyarray=np.array([[50000,60000],['john','harry']])
df=pd.DataFrame({'name':numpyarray[1],'salary':numpyarray[0]})
df

    name salary
0   john  50000
1  harry  60000

# how to perform marge operation between two dataframe?

In [16]:
player=['player1','player2','player3']
points=[4,3,5]
title=['game1','game2','game3']
df1=pd.DataFrame({'Player':player,'Point':points,'Title':title})
df1

    Player  Point  Title
0  player1      4  game1
1  player2      3  game2
2  player3      5  game3

In [17]:
player=['player1','player5','player6']
power=['punch','kick','elbow']
title=['game1','game5','game6']
df2=pd.DataFrame({'Player':player,'Power':power,'Title':title})
df2

    Player  Power  Title
0  player1  punch  game1
1  player5   kick  game5
2  player6  elbow  game6

In [19]:
# Inner Merge
#by defult merge perform inner merge

df1.merge(df2 , on='Title', how='inner')

  Player_x  Point  Title Player_y  Power
0  player1      4  game1  player1  punch

In [20]:
# Left Merge

df1.merge(df2 , on='Title', how='left')

  Player_x  Point  Title Player_y  Power
0  player1      4  game1  player1  punch
1  player2      3  game2      NaN    NaN
2  player3      5  game3      NaN    NaN

In [21]:
#Right Merge
df1.merge(df2 , on='Title', how='right')

  Player_x  Point  Title Player_y  Power
0  player1    4.0  game1  player1  punch
1      NaN    NaN  game5  player5   kick
2      NaN    NaN  game6  player6  elbow

In [22]:
# Outer Merge
df1.merge(df2 , on='Title', how='outer')

  Player_x  Point  Title Player_y  Power
0  player1    4.0  game1  player1  punch
1  player2    3.0  game2      NaN    NaN
2  player3    5.0  game3      NaN    NaN
3      NaN    NaN  game5  player5   kick
4      NaN    NaN  game6  player6  elbow